In [5]:
import pandas as pd
import numpy as np

In [19]:
 df = pd.DataFrame({'nome': [1, 1, 2, 2],
                    'qtd': [2, 1, 2, 2],
                    'mes': ['jan', 'jan', 'jan', 'fev'],
                    'item': ['cel', 'cel', 'caneta', 'cel']})

In [22]:
df

   nome  qtd  mes    item
0     1    2  jan     cel
1     1    1  jan     cel
2     2    2  jan  caneta
3     2    2  fev     cel

In [33]:
result_mean = df.groupby(['nome', 'mes', 'item']).agg('qtd').mean().reset_index()
result_mean

   nome  mes    item  qtd
0     1  jan     cel  1.5
1     2  fev     cel  2.0
2     2  jan  caneta  2.0

In [25]:
new_df = pd.merge(df, result_mean,  how='left', left_on=['nome','mes', 'item'], right_on = ['nome','mes', 'item'])

In [26]:
new_df

   nome  qtd_x  mes    item  qtd_y
0     1      2  jan     cel    1.5
1     1      1  jan     cel    1.5
2     2      2  jan  caneta    2.0
3     2      2  fev     cel    2.0